app/controllers/users_controller.rb

def create
  @user = User.new(params[:user])
  if @user.save
---
INSERT INTO "users" ("about_me", "created_at", "deparment", "email", "first_name", "gender", "image", "last_name", "password_hash", "password_salt", "terms", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "users" SET "updated_at" = '2012-08-14 11:43:03.949400', "image" = '--- !ruby/object:ActionDispatch::Http::UploadedFile